add more miniapps
